import 'package:flutter/material.dart';

class HistoryWidget extends StatefulWidget {
  @override
  _HistoryWidgetState createState() => _HistoryWidgetState();
}

class _HistoryWidgetState extends State<HistoryWidget> {
  @override
  Widget build(BuildContext context) {
    return ListView(padding: EdgeInsets.all(16.0),
      children: <Widget>[
        content1(),mySizebox(),
        content2(),mySizebox(),
        content3(),mySizebox(),
        content4(),mySizebox(),
        content5(),mySizebox(),
        content6(),mySizebox(),
        content7(),mySizebox(),
        content8(),mySizebox(),
      ],
    );
  }

  SizedBox mySizebox() => SizedBox(height: 16.0,);

  Text content1() => Text(
      'วิทยาลัยเทคโนโลยีอุตสาหกรรม (วทอ.) เป็นส่วนงานระดับคณะของมหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ แรกก่อตั้งขึ้นจากโครงการความร่วมมือทางเศรษฐกิจและวิชาการระหว่างรัฐบาลไทยกับรัฐบาลสหพันธ์สาธารณรัฐเยอรมันใน ปี พ.ศ. 2502 โดยจัดตั้งเป็น “โรงเรียนเทคนิคพระนครเหนือ” (เทคนิคไทย-เยอรมัน) เพื่อผลิตช่างฝีมือระบบเยอรมันที่มุ่งเน้นการปฏิบัติและประสบการณ์จริงในโรงงาน ให้สอดคล้องกับความต้องการของภาคอุตสาหกรรม โดยจัดการศึกษาหลักสูตรประกาศนียบัตรวิชาชีพ (ปวช.) 4 สาขา');
  Text content2() => Text(
      'ปี พ.ศ. 2507 โรงเรียนเทคนิคพระนครเหนือ ได้ยกฐานะขึ้นเป็น “วิทยาลัยเทคนิคพระนครเหนือ” จัดการศึกษาระดับประกาศนียบัตรวิชาชีพ (ปวช.) และประกาศนียบัตรวิชาชีพชั้นสูง (ปวส.) รวม 8 สาขา');
  Text content3() => Text(
      'ปี พ.ศ. 2514 วิทยาลัยเทคนิคพระนครเหนือ วิทยาลัยเทคนิคธนบุรี และวิทยาลัยโทรคมนาคมนนทบุรี ได้รวมกันจัดตั้งเป็นสถาบันระดับอุดมศึกษา พระบาทสมเด็จพระเจ้าอยู่หัวภูมิพลอดุยเดช รัชกาลที่ 9 ได้พระราชทานนามว่า “สถาบันเทคโนโลยีพระจอมเกล้า” เมื่อวันที่ 23 เมษายน 2514 โดยมีวิทยาลัยทั้งสามแห่งเป็นวิทยาเขต แต่ละวิทยาเขตมีนามตามสถานที่ตั้งต่อท้ายนามพระราชทาน ดังนั้น วิทยาลัยเทคนิคพระนครเหนือ จึงใช้ชื่อว่า “สถาบันเทคโนโลยีพระจอมเกล้าวิทยาเขตพระนครเหนือ” และเพื่อให้การจัดตั้งคณะวิศวกรรมศาสตร์ ซึ่งเป็นคณะแรกของ ');
  Text content4() => Text(
      'สถาบันบรรลุผล วิทยาลัยเทคนิคพระนครเหนือเดิม จึงรวมเข้าเป็นภาควิชาหนึ่งของคณะวิศวกรรมศาสตร์มีชื่อว่า “ภาควิชาเทคโนโลยีอุตสาหกรรม”');

  Text content5() => Text(
      'ปี พ.ศ. 2523 ภาควิชาเทคโนโลยีอุตสาหกรรม ได้แยกออกมาจัดตั้งเป็น “วิทยาลัยเทคโนโลยีอุตสาหกรรม” จัดการศึกษาระดับประกาศนียบัตรวิชาชีพ (ปวช.) และระดับประกาศนียบัตรวิชาชีพชั้นสูง (ปวส.) รวม 25 สาขา');
  Text content6() => Text(
      'ปี พ.ศ. 2524 วิทยาลัยเทคโนโลยีอุตสาหกรรมได้พัฒนาหลักสูตรระดับประกาศนียบัตรวิชาชีพ (ปวช.) เป็นหลักสูตร “เตรียมวิศวกรรมศาสตร์” เป็นแห่งแรกของประเทศไทย เพื่อให้สอดคล้องกับการปฏิรูปการศึกษา และความต้องการของภาคอุตสาหกรรม');
  Text content7() => Text(
      'ปี พ.ศ. 2536 วิทยาลัยเปิดสอนหลักสูตรอุตสาหกรรมศาสตร์บัณฑิต (อส.บ) ซึ่งเป็นหลักสูตร 2 ปี (เต็มเวลา) และ 3 ปี (ไม่เต็มเวลา) รวม 2 สาขาวิชา โดยเปิดหลักสูตรอุตสาหกรรมศาสตร์บัณฑิต (อส.บ) 2 ปีขึ้นอีก 3 สาขาวิชาในปี พ.ศ. 2537');
  Text content8() => Text(
      'ปี พ.ศ. 2544 วิทยาลัยเปิดหลักสูตรวิศวกรรมศาสตร์บัณฑิต (วศ.บ) ซึ่งเป็นหลักสูตร 4 ปี รวม 3 สาขาวิชา และเปิดเพิ่มขึ้นอีก 4 สาขาวิชาในปี พ.ศ. 2545');
}
